# Задание_4

n = int(input("Введите !ЦЕЛОЕ! !ПОЛОЖИТЕЛЬНОЕ! число: "))
n_1 = n % 10
n = n // 10
while n > 0:
    if n % 10 > n_1:
        n_1 = n % 10
    n = n // 10.
print(f"{n_1:.0n}")
