# Задание_1

a = 2022
b = 27
c = a - b
d = "Республика Беларусь, Минская область, г.Борисов"
name_1 = input("Введите имя вашего преподавателя: ")
name_2 = input("Введите ваше имя: ")
print("Здравствуйте, ", name_1, "! Меня зовут ", name_2, " и я только начинаю знакомится с Python.", sep="")
print("Мой адрес: ", d, sep="")
print("Мой возраст:", b)
print("Мой год рождения:", c)